src/test/load/jmeter/VariousConcurrentOperationsTest.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="2.6" jmeter="2.11 r1554548">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Various concurrent operations test" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments">
          <elementProp name="TestPlan.max_key_value" elementType="Argument">
            <stringProp name="Argument.name">TestPlan.max_key_value</stringProp>
            <stringProp name="Argument.value">10</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="TestPlan.threads_count" elementType="Argument">
            <stringProp name="Argument.name">TestPlan.threads_count</stringProp>
            <stringProp name="Argument.value">100</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="TestPlan.iterations_count" elementType="Argument">
            <stringProp name="Argument.name">TestPlan.iterations_count</stringProp>
            <stringProp name="Argument.value">10000</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="TestPlan.max_path_depth" elementType="Argument">
            <stringProp name="Argument.name">TestPlan.max_path_depth</stringProp>
            <stringProp name="Argument.value">4</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
        </collectionProp>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Threads" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">startnextloop</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">${TestPlan.iterations_count}</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">${TestPlan.threads_count}</stringProp>
        <stringProp name="ThreadGroup.ramp_time">0</stringProp>
        <longProp name="ThreadGroup.start_time">1413520848000</longProp>
        <longProp name="ThreadGroup.end_time">1413520848000</longProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
      </ThreadGroup>
      <hashTree>
        <BeanShellPreProcessor guiclass="TestBeanGUI" testclass="BeanShellPreProcessor" testname="Generate random item key" enabled="true">
          <boolProp name="resetInterpreter">false</boolProp>
          <stringProp name="script">import java.util.*;
import java.io.*;

Random random = new Random();
int maxDepth = Integer.parseInt(vars.get(&quot;TestPlan.max_path_depth&quot;));
int boundForRandom = Integer.parseInt(vars.get(&quot;TestPlan.max_key_value&quot;));
StringBuilder builder = new StringBuilder();
int currentDepth = random.nextInt(maxDepth) + 1;

for (int i = 0; i &lt; currentDepth; ++i) {
	int level = random.nextInt(boundForRandom) + 1;
	builder.append(level);
	if (i != currentDepth - 1) {
	    builder.append(&quot;/&quot;);		
	}
}
key = builder.toString();

log.info(&quot;Generated key &quot; + key);
vars.put(&quot;item_key&quot;, key);</stringProp>
        </BeanShellPreProcessor>
        <hashTree/>
        <RandomController guiclass="RandomControlGui" testclass="RandomController" testname="Random Controller" enabled="true">
          <intProp name="InterleaveControl.style">1</intProp>
        </RandomController>
        <hashTree>
          <JUnitSampler guiclass="JUnitTestSamplerGui" testclass="JUnitSampler" testname="getValue" enabled="true">
            <stringProp name="junitSampler.classname">net.thumbtack.configServer.ConfigurationServerTest</stringProp>
            <stringProp name="junitsampler.constructorstring">${item_key}</stringProp>
            <stringProp name="junitsampler.method">testGetValue</stringProp>
            <stringProp name="junitsampler.success">Test successful</stringProp>
            <stringProp name="junitsampler.success.code">1000</stringProp>
            <stringProp name="junitsampler.failure">Test failed</stringProp>
            <stringProp name="junitsampler.failure.code">0001</stringProp>
            <stringProp name="junitsampler.error">An unexpected error occured</stringProp>
            <stringProp name="junitsampler.error.code">9999</stringProp>
            <stringProp name="junitsampler.exec.setup">false</stringProp>
            <stringProp name="junitsampler.append.error">false</stringProp>
            <stringProp name="junitsampler.append.exception">false</stringProp>
            <boolProp name="junitsampler.junit4">true</boolProp>
            <boolProp name="junitsampler.createinstancepersample">true</boolProp>
          </JUnitSampler>
          <hashTree/>
          <JUnitSampler guiclass="JUnitTestSamplerGui" testclass="JUnitSampler" testname="insert" enabled="true">
            <stringProp name="junitSampler.classname">net.thumbtack.configServer.ConfigurationServerTest</stringProp>
            <stringProp name="junitsampler.constructorstring">${item_key}</stringProp>
            <stringProp name="junitsampler.method">testInsert</stringProp>
            <stringProp name="junitsampler.success">Test successful</stringProp>
            <stringProp name="junitsampler.success.code">1000</stringProp>
            <stringProp name="junitsampler.failure">Test failed</stringProp>
            <stringProp name="junitsampler.failure.code">0001</stringProp>
            <stringProp name="junitsampler.error">An unexpected error occured</stringProp>
            <stringProp name="junitsampler.error.code">9999</stringProp>
            <stringProp name="junitsampler.exec.setup">false</stringProp>
            <stringProp name="junitsampler.append.error">false</stringProp>
            <stringProp name="junitsampler.append.exception">false</stringProp>
            <boolProp name="junitsampler.createinstancepersample">true</boolProp>
            <boolProp name="junitsampler.junit4">true</boolProp>
          </JUnitSampler>
          <hashTree/>
          <JUnitSampler guiclass="JUnitTestSamplerGui" testclass="JUnitSampler" testname="remove" enabled="true">
            <stringProp name="junitSampler.classname">net.thumbtack.configServer.ConfigurationServerTest</stringProp>
            <stringProp name="junitsampler.constructorstring">${item_key}</stringProp>
            <stringProp name="junitsampler.method">testRemove</stringProp>
            <stringProp name="junitsampler.success">Test successful</stringProp>
            <stringProp name="junitsampler.success.code">1000</stringProp>
            <stringProp name="junitsampler.failure">Test failed</stringProp>
            <stringProp name="junitsampler.failure.code">0001</stringProp>
            <stringProp name="junitsampler.error">An unexpected error occured</stringProp>
            <stringProp name="junitsampler.error.code">9999</stringProp>
            <stringProp name="junitsampler.exec.setup">false</stringProp>
            <stringProp name="junitsampler.append.error">false</stringProp>
            <stringProp name="junitsampler.append.exception">false</stringProp>
            <boolProp name="junitsampler.createinstancepersample">true</boolProp>
            <boolProp name="junitsampler.junit4">true</boolProp>
          </JUnitSampler>
          <hashTree/>
          <JUnitSampler guiclass="JUnitTestSamplerGui" testclass="JUnitSampler" testname="getChildren" enabled="true">
            <stringProp name="junitSampler.classname">net.thumbtack.configServer.ConfigurationServerTest</stringProp>
            <stringProp name="junitsampler.constructorstring">${item_key}</stringProp>
            <stringProp name="junitsampler.method">testGetChildren</stringProp>
            <stringProp name="junitsampler.success">Test successful</stringProp>
            <stringProp name="junitsampler.success.code">1000</stringProp>
            <stringProp name="junitsampler.failure">Test failed</stringProp>
            <stringProp name="junitsampler.failure.code">0001</stringProp>
            <stringProp name="junitsampler.error">An unexpected error occured</stringProp>
            <stringProp name="junitsampler.error.code">9999</stringProp>
            <stringProp name="junitsampler.exec.setup">false</stringProp>
            <stringProp name="junitsampler.append.error">false</stringProp>
            <stringProp name="junitsampler.append.exception">false</stringProp>
            <boolProp name="junitsampler.createinstancepersample">true</boolProp>
            <boolProp name="junitsampler.junit4">true</boolProp>
          </JUnitSampler>
          <hashTree/>
          <JUnitSampler guiclass="JUnitTestSamplerGui" testclass="JUnitSampler" testname="exists" enabled="true">
            <stringProp name="junitSampler.classname">net.thumbtack.configServer.ConfigurationServerTest</stringProp>
            <stringProp name="junitsampler.constructorstring">${item_key}</stringProp>
            <stringProp name="junitsampler.method">testExists</stringProp>
            <stringProp name="junitsampler.success">Test successful</stringProp>
            <stringProp name="junitsampler.success.code">1000</stringProp>
            <stringProp name="junitsampler.failure">Test failed</stringProp>
            <stringProp name="junitsampler.failure.code">0001</stringProp>
            <stringProp name="junitsampler.error">An unexpected error occured</stringProp>
            <stringProp name="junitsampler.error.code">9999</stringProp>
            <stringProp name="junitsampler.exec.setup">false</stringProp>
            <stringProp name="junitsampler.append.error">false</stringProp>
            <stringProp name="junitsampler.append.exception">false</stringProp>
            <boolProp name="junitsampler.createinstancepersample">true</boolProp>
            <boolProp name="junitsampler.junit4">true</boolProp>
          </JUnitSampler>
          <hashTree/>
        </hashTree>
        <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
          <objProp>
            <value class="SampleSaveConfiguration">
              <time>true</time>
              <latency>true</latency>
              <timestamp>true</timestamp>
              <success>true</success>
              <label>true</label>
              <code>true</code>
              <message>true</message>
              <threadName>true</threadName>
              <dataType>true</dataType>
              <encoding>false</encoding>
              <assertions>true</assertions>
              <subresults>true</subresults>
              <responseData>false</responseData>
              <samplerData>false</samplerData>
              <xml>false</xml>
              <fieldNames>false</fieldNames>
              <responseHeaders>false</responseHeaders>
              <requestHeaders>false</requestHeaders>
              <responseDataOnError>false</responseDataOnError>
              <saveAssertionResultsFailureMessage>false</saveAssertionResultsFailureMessage>
              <assertionsResultsToSave>0</assertionsResultsToSave>
              <bytes>true</bytes>
            </value>
          </objProp>
          <objProp>
            <value class="SampleSaveConfiguration">
              <time>true</time>
              <latency>true</latency>
              <timestamp>true</timestamp>
              <success>true</success>
              <label>true</label>
              <code>true</code>
              <message>true</message>
              <threadName>true</threadName>
              <dataType>true</dataType>
              <encoding>false</encoding>
              <assertions>true</assertions>
              <subresults>true</subresults>
              <responseData>false</responseData>
              <samplerData>false</samplerData>
              <xml>false</xml>
              <fieldNames>false</fieldNames>
              <responseHeaders>false</responseHeaders>
              <requestHeaders>false</requestHeaders>
              <responseDataOnError>false</responseDataOnError>
              <saveAssertionResultsFailureMessage>false</saveAssertionResultsFailureMessage>
              <assertionsResultsToSave>0</assertionsResultsToSave>
              <bytes>true</bytes>
            </value>
          </objProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="RespTimeGraphVisualizer" testclass="ResultCollector" testname="Response Time Graph" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
          <objProp>
            <value class="SampleSaveConfiguration">
              <time>true</time>
              <latency>true</latency>
              <timestamp>true</timestamp>
              <success>true</success>
              <label>true</label>
              <code>true</code>
              <message>true</message>
              <threadName>true</threadName>
              <dataType>true</dataType>
              <encoding>false</encoding>
              <assertions>true</assertions>
              <subresults>true</subresults>
              <responseData>false</responseData>
              <samplerData>false</samplerData>
              <xml>false</xml>
              <fieldNames>false</fieldNames>
              <responseHeaders>false</responseHeaders>
              <requestHeaders>false</requestHeaders>
              <responseDataOnError>false</responseDataOnError>
              <saveAssertionResultsFailureMessage>false</saveAssertionResultsFailureMessage>
              <assertionsResultsToSave>0</assertionsResultsToSave>
              <bytes>true</bytes>
            </value>
          </objProp>
          <objProp>
            <value class="SampleSaveConfiguration">
              <time>true</time>
              <latency>true</latency>
              <timestamp>true</timestamp>
              <success>true</success>
              <label>true</label>
              <code>true</code>
              <message>true</message>
              <threadName>true</threadName>
              <dataType>true</dataType>
              <encoding>false</encoding>
              <assertions>true</assertions>
              <subresults>true</subresults>
              <responseData>false</responseData>
              <samplerData>false</samplerData>
              <xml>false</xml>
              <fieldNames>false</fieldNames>
              <responseHeaders>false</responseHeaders>
              <requestHeaders>false</requestHeaders>
              <responseDataOnError>false</responseDataOnError>
              <saveAssertionResultsFailureMessage>false</saveAssertionResultsFailureMessage>
              <assertionsResultsToSave>0</assertionsResultsToSave>
              <bytes>true</bytes>
            </value>
          </objProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="SplineVisualizer" testclass="ResultCollector" testname="Spline Visualizer" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
          <objProp>
            <value class="SampleSaveConfiguration">
              <time>true</time>
              <latency>true</latency>
              <timestamp>true</timestamp>
              <success>true</success>
              <label>true</label>
              <code>true</code>
              <message>true</message>
              <threadName>true</threadName>
              <dataType>true</dataType>
              <encoding>false</encoding>
              <assertions>true</assertions>
              <subresults>true</subresults>
              <responseData>false</responseData>
              <samplerData>false</samplerData>
              <xml>false</xml>
              <fieldNames>false</fieldNames>
              <responseHeaders>false</responseHeaders>
              <requestHeaders>false</requestHeaders>
              <responseDataOnError>false</responseDataOnError>
              <saveAssertionResultsFailureMessage>false</saveAssertionResultsFailureMessage>
              <assertionsResultsToSave>0</assertionsResultsToSave>
              <bytes>true</bytes>
            </value>
          </objProp>
          <objProp>
            <value class="SampleSaveConfiguration">
              <time>true</time>
              <latency>true</latency>
              <timestamp>true</timestamp>
              <success>true</success>
              <label>true</label>
              <code>true</code>
              <message>true</message>
              <threadName>true</threadName>
              <dataType>true</dataType>
              <encoding>false</encoding>
              <assertions>true</assertions>
              <subresults>true</subresults>
              <responseData>false</responseData>
              <samplerData>false</samplerData>
              <xml>false</xml>
              <fieldNames>false</fieldNames>
              <responseHeaders>false</responseHeaders>
              <requestHeaders>false</requestHeaders>
              <responseDataOnError>false</responseDataOnError>
              <saveAssertionResultsFailureMessage>false</saveAssertionResultsFailureMessage>
              <assertionsResultsToSave>0</assertionsResultsToSave>
              <bytes>true</bytes>
            </value>
          </objProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>